In [1]:
import pandas as pd 
sample_1 = pd.read_excel('sample_1.xlsx', 
                         header=1, 
                         skipfooter=2, 
                         usecols='A:C')
sample_1.head(3)

  국적코드  성별    입국객수
0  A01  남성  106320
1  A01  여성  191436
2  A31  남성     319

In [2]:
sample_1.tail(3)

  국적코드  성별    입국객수
3  A31  여성      42
4  A18  남성  158912
5  A18  여성  232943

In [3]:
sample_1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   국적코드    6 non-null      object
 1   성별      6 non-null      object
 2   입국객수    6 non-null      int64
dtypes: int64(1), object(2)
memory usage: 272.0+ bytes

In [4]:
sample_1.describe()

                입국객수
count       6.000000
mean   114995.333333
std     98105.752006
min        42.000000
25%     26819.250000
50%    132616.000000
75%    183305.000000
max    232943.000000

In [5]:
sample_1['입국객수']

0    106320
1    191436
2       319
3        42
4    158912
5    232943
Name: 입국객수, dtype: int64

In [7]:
sample_1[['국적코드','입국객수']]

  국적코드    입국객수
0  A01  106320
1  A01  191436
2  A31     319
3  A31      42
4  A18  158912
5  A18  232943

In [8]:
sample_1['기준년월'] = '2020-11'
sample_1

  국적코드  성별    입국객수     기준년월
0  A01  남성  106320  2020-11
1  A01  여성  191436  2020-11
2  A31  남성     319  2020-11
3  A31  여성      42  2020-11
4  A18  남성  158912  2020-11
5  A18  여성  232943  2020-11

In [9]:
condition = (sample_1['성별']=='남성')   # 성별이 남성인 경우
condition

0     True
1    False
2     True
3    False
4     True
5    False
Name: 성별, dtype: bool

In [10]:
sample_1[condition]

  국적코드  성별    입국객수     기준년월
0  A01  남성  106320  2020-11
2  A31  남성     319  2020-11
4  A18  남성  158912  2020-11

In [11]:
condition = (sample_1['입국객수'] >= 150000)   # 성별이 남성인 경우
sample_1[condition]

  국적코드  성별    입국객수     기준년월
1  A01  여성  191436  2020-11
4  A18  남성  158912  2020-11
5  A18  여성  232943  2020-11

In [14]:
# 성별이 남성이면서 입국객수가 150,000명 이상인 경우
conditions = (sample_1['성별'] == '남성') & (sample_1['입국객수'] >= 150000)
sample_1[conditions]

  국적코드  성별    입국객수     기준년월
4  A18  남성  158912  2020-11

In [16]:
# 국적코드가 A01이거나 A18인 경우
conditions = (sample_1['국적코드'] == 'A01') \
                | (sample_1['국적코드'] == 'A18')
sample_1[conditions]

  국적코드  성별    입국객수     기준년월
0  A01  남성  106320  2020-11
1  A01  여성  191436  2020-11
4  A18  남성  158912  2020-11
5  A18  여성  232943  2020-11

In [17]:
conditions = (sample_1['국적코드'].isin(['A01', 'A18'])) 
sample_1[conditions]

  국적코드  성별    입국객수     기준년월
0  A01  남성  106320  2020-11
1  A01  여성  191436  2020-11
4  A18  남성  158912  2020-11
5  A18  여성  232943  2020-11

In [18]:
conditions

0     True
1     True
2    False
3    False
4     True
5     True
Name: 국적코드, dtype: bool

In [19]:
sample_1[conditions==False] # 위의 A01, A18만 제외하고

  국적코드  성별  입국객수     기준년월
2  A31  남성   319  2020-11
3  A31  여성    42  2020-11

In [20]:
code_master = pd.read_excel('sample_codemaster.xlsx')
code_master

  국적코드     국적명
0  A01      일본
1  A02      대만
2  A03      홍콩
3  A18      중국
4  A19      이란
5  A22  우즈베키스탄
6  A23   카자흐스탄
7  A99  아시아 기타

In [21]:
sample_1_code = pd.merge(left = sample_1, 
                         right = code_master,
                         how = 'left', # 왼쪽 테이블 기준으로 결합
                         left_on = '국적코드',
                         right_on = '국적코드')
sample_1_code

  국적코드  성별    입국객수     기준년월  국적명
0  A01  남성  106320  2020-11   일본
1  A01  여성  191436  2020-11   일본
2  A31  남성     319  2020-11  NaN
3  A31  여성      42  2020-11  NaN
4  A18  남성  158912  2020-11   중국
5  A18  여성  232943  2020-11   중국

In [22]:
sample_2 = pd.read_excel('sample_2.xlsx', 
                         header=1, 
                         skipfooter=2, 
                         usecols='A:C')
sample_2['기준년월'] = '2020-12'

In [23]:
sample_2_code = pd.merge(left = sample_2,
                        right = code_master,
                        how = 'left',
                        left_on = '국적코드',
                        right_on = '국적코드')
sample_2_code

  국적코드  성별    입국객수     기준년월 국적명
0  A01  남성   92556  2020-12  일본
1  A01  여성  163737  2020-12  일본
2  A18  남성  155540  2020-12  중국
3  A18  여성  249023  2020-12  중국

In [24]:
sample = sample_1_code.append(sample_2_code, ignore_index = True)
sample

  국적코드  성별    입국객수     기준년월  국적명
0  A01  남성  106320  2020-11   일본
1  A01  여성  191436  2020-11   일본
2  A31  남성     319  2020-11  NaN
3  A31  여성      42  2020-11  NaN
4  A18  남성  158912  2020-11   중국
5  A18  여성  232943  2020-11   중국
6  A01  남성   92556  2020-12   일본
7  A01  여성  163737  2020-12   일본
8  A18  남성  155540  2020-12   중국
9  A18  여성  249023  2020-12   중국

In [25]:
sample.to_excel('sample.xlsx')

In [26]:
sample.to_excel('sample.xlsx', index = False)

In [27]:
sample_pivot = sample.pivot_table(values = '입국객수',
                                 index = '국적명', 
                                 columns = '기준년월',
                                 aggfunc = 'mean')
sample_pivot

기준년월   2020-11   2020-12
국적명
일본    148878.0  128146.5
중국    195927.5  202281.5

In [28]:
sample_pivot = sample.pivot_table(values = '입국객수',
                                 index = '국적명',
                                 aggfunc = 'max')
sample_pivot

       입국객수
국적명
일본   191436
중국   249023